Revit 2027 API
BuiltInFailures.CopyPasteFailures.CannotCopyMultipleSketchParents Property
 Copying elements from unrelated Workplanes together is not supported in families. Try copying elements separately.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCopyMultipleSketchParents { get; }
Public Shared ReadOnly Property CannotCopyMultipleSketchParents As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCopyMultipleSketchParents {
	FailureDefinitionId^ get ();
}
static member CannotCopyMultipleSketchParents : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace